particle-iot/device-os/hal/src/stm32f2xx/can_hal.c
    // Deinitialise CAN
    CAN_DeInit(canMap[channel]->can_peripheral);

    // Disable CAN Receive and Transmit interrupts
    CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, DISABLE);
    CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_FMP0, DISABLE);

    NVIC_InitTypeDef NVIC_InitStructure;

    //Disable the CAN Tx Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = canMap[channel]->can_tx_irqn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    //Disable the CAN Rx FIFO 0 Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = canMap[channel]->can_rx0_irqn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
    NVIC_Init(&NVIC_InitStructure);

    // Disable CAN Clock
    *canMap[channel]->can_apbReg &= ~canMap[channel]->can_clock_en;

    // clear any received data
    canMap[channel]->can_rx_buffer->head = canMap[channel]->can_rx_buffer->tail;

    // Undo any pin re-mapping done for this CAN
    // ...

    memset(canMap[channel]->can_rx_buffer, 0, sizeof(CAN_Ring_Buffer));
    memset(canMap[channel]->can_tx_buffer, 0, sizeof(CAN_Ring_Buffer));

    canMap[channel]->can_enabled = false;
    canMap[channel]->can_transmitting = false;
}

uint32_t HAL_USART_Write_Data(HAL_CAN_Channel channel, CAN_Message_Struct *pmessage)
{
    
    // interrupts are off and data in queue;
	if ((CAN_GetITStatus(canMap[channel]->can_peripheral, CAN_IT_TME) == RESET)
			&& (canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail)) 
        {
		// Get him busy
		CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, ENABLE);
	}

	unsigned i = (canMap[channel]->can_tx_buffer->head + 1) % CAN_BUFFER_SIZE;

	// If the output buffer is full, there's nothing for it other than to
	// wait for the interrupt handler to empty it a bit
	//         no space so       or  Called Off Panic with interrupt off get the message out!
	//         make space                     Enter Polled IO mode
	while (i == canMap[channel]->can_tx_buffer->tail || ((__get_PRIMASK() & 1) && canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail) ) 
        {
		// Interrupts are on but they are not being serviced because this was called from a higher
		// Priority interrupt

		if (CAN_GetITStatus(canMap[channel]->can_peripheral, CAN_IT_TME) && CAN_GetFlagStatus(canMap[channel]->can_peripheral, CAN_IT_TME))
		{
                    // protect for good measure
                    CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, DISABLE);
                    // Write out a byte
                    CanTxMsg txmessage;
                    if (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Ext)
                    {
                      txmessage.ExtId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x1FFFFFFFUL);
                      txmessage.StdId = 0U;
                      txmessage.IDE = CAN_Id_Extended;
                    }
                    else
                    {
                      txmessage.ExtId = 0UL;
                      txmessage.StdId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x7FFUL);  
                      txmessage.IDE = CAN_Id_Standard;
                    }
                    if (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].rtr)
                    {
                      txmessage.RTR = CAN_RTR_REMOTE;
                    }
                    else
                    {
                        txmessage.RTR = CAN_RTR_DATA;
                    }
                    txmessage.DLC = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Len;     
                    txmessage.Data[0] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[0];
                    txmessage.Data[1] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[1];
                    txmessage.Data[2] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[2];
                    txmessage.Data[3] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[3];
                    txmessage.Data[4] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[4];
                    txmessage.Data[5] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[5];
                    txmessage.Data[6] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[6];
                    txmessage.Data[7] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[7];

                    if (CAN_TxStatus_NoMailBox != CAN_Transmit(canMap[channel]->can_peripheral, &txmessage))
                    {
                            canMap[channel]->can_tx_buffer->tail++;
                            canMap[channel]->can_tx_buffer->tail %= CAN_BUFFER_SIZE;
                    }
                    // unprotect
                    CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, ENABLE);
		}
	}

	memcpy((void *)&(canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->head]),(void *)pmessage, sizeof(CAN_Message_Struct));
	canMap[channel]->can_tx_buffer->head = i;
	canMap[channel]->can_transmitting = true;
	CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, ENABLE);

	return 1;
}

int32_t HAL_CAN_Available_Data(HAL_CAN_Channel channel)
{
	return (unsigned int)(CAN_BUFFER_SIZE + canMap[channel]->can_rx_buffer->head - canMap[channel]->can_rx_buffer->tail) % CAN_BUFFER_SIZE;
}

int32_t HAL_CAN_Read_Data(HAL_CAN_Channel channel, CAN_Message_Struct *pmessage)
{
	// if the head isn't ahead of the tail, we don't have any messages
	if ((canMap[channel]->can_rx_buffer->head == canMap[channel]->can_rx_buffer->tail) ||
                (NULL == pmessage))
	{
		return -1;
	}
	else
	{
		memcpy((void *)pmessage, (void *)&(canMap[channel]->can_rx_buffer->buffer[canMap[channel]->can_rx_buffer->tail]), sizeof(CAN_Message_Struct));
		canMap[channel]->can_rx_buffer->tail = (unsigned int)(canMap[channel]->can_rx_buffer->tail + 1) % CAN_BUFFER_SIZE;
		return 1;
	}
}

int32_t HAL_CAN_Peek_Data(HAL_CAN_Channel channel, CAN_Message_Struct *pmessage)
{
	if (canMap[channel]->can_rx_buffer->head == canMap[channel]->can_rx_buffer->tail)
	{
            return -1;
	}
	else
	{
            memcpy((void *)pmessage, (void *)&(canMap[channel]->can_rx_buffer->buffer[canMap[channel]->can_rx_buffer->tail]), sizeof(CAN_Message_Struct));
            return 1;
	}
}

void HAL_CAN_Flush_Data(HAL_CAN_Channel channel)
{
//TODO // Loop until USART DR register is empty
	//while ( canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail );
	// Loop until last frame transmission complete
	//while (canMap[channel]->can_transmitting && (USART_GetFlagStatus(canMap[channel]->can_peripheral, USART_FLAG_TC) == RESET));
	//canMap[channel]->can_transmitting = false;
}

